# LastRowNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..LastRowNumber Property
TableSectionData Class See Also
---
The last row in this section of the table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int LastRowNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LastRowNumber As Integer
	Get
```

Visual C++
---
```text
public:
property int LastRowNumber {
	int get ();
}
```

# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace